app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE (lower(email) = 'qo@aol.com') LIMIT ?  [["LIMIT", 1]]
---
  def create
    user = User.find_by("lower(email) = ?", params[:email].downcase)