app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"
---
    def index
       messages = Message.all

INSERT INTO "messages" ("sender_id", "receiver_id", "title", "body", "message_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        message = Message.create(message_params)