app/controllers/transactions_controller.rb

    def index
       transactions = Transaction.all
---
SELECT "transactions".* FROM "transactions"