app/controllers/users_controller.rb

    def index
       allUsers = User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)