app/controllers/user_services_controller.rb

    def index
       userServices = UserService.all
---
SELECT "user_services".* FROM "user_services"